export const projectData = [
  {
    id: 1,
    type: "프로젝트",
    year: "2022.06.10",
    title: "취업준비 포트폴리오 모집합니다",
    tag: ["#온라인", "#1명", "#2개월"],
    skills: ["React", "javascript", "nestjs"],
    write: "james",
    view: "30",
    comment: "0",
    contact: "email",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `개인 프로젝트로는 면접과 경험에 한계가 있어보여

포트폴리오로 제출 할 팀 프로젝트를 진행해보려고 합니다.



기획은 어느정도 진행이 된 상태이며,

현재 디자이너 1명, 프론트엔드 1명, 백엔드 2명으로 구성되어있습니다.



기간은 8월 초까지 진행할 예정입니다.



기술 스택은 리액트(Next.js)를 사용하고 온라인 구인이므로 책임감을 갖고 끝까지 프로젝트에 참여해서 의미있는 시간을 보내셨으면 합니다!`,
  },
  {
    id: 2,
    type: "프로젝트",
    year: "1999.02.11",
    title: "백앤드 어서오세요~!!!",
    tag: ["#온라인", "#4명", "#12개월"],
    skills: ["spring", "typescript", "nodejs"],
    write: "mina",
    view: "100123",
    comment: "1230",
    contact: "email",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `Vlip이라는 서비스를 만들고 있는 스타트업 입니다. 현재 팀원은 PM, 모바일 개발자, 디자이너 이렇게 총 세명인 상태이고, 백엔드 개발자 분을 현재 찾고 있습니다.



    현재 팀원들 모두 사이드 프로젝트 형식으로 진행중이니 참고바랍니다!
    
    
    
    자세한 내용은 아래 노션페이지에서 확인 부탁드립니다!
    
    https://xperiventure.notion.site/Vlip-e185a6a92bcd46ae85e6b0fd703fc4c0`,
  },
  {
    id: 3,
    type: "프로젝트",
    year: "2222.12.23",
    title: "모드들 행복하세요~!!!",
    tag: ["#오프라인", "#1231명", "#1초"],
    skills: ["bootstrap", "hahah", "node"],
    write: "제갈공명",
    view: "111111",
    contact: "카카오톡",
    comment: "22",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `첫시작은 카페24의 앱스토어를 겨냥해서 쇼핑몰에 도움이 되는 기능을 개발하는 작업이 필요합니다.



    조건은 이렇습니다
    
    1. 이미 많이 개발된 카테고리는 제외합니다. (리뷰, 채널톡, 타임세일 등등등)
    
    ㄴ 시장진입하기 위해 시간, 노력이 너무 많이 필요함
    
    2. 복잡하지 않고 간단하게 사용가능한 기능
    
    그외의 내용은 차차 정해가면 좋습니다.
    
    
    
    디자인 1 명 (ui/ux경험이 있으면 매우좋고, ui/ux를 해볼려고 노력하는분도 매우좋습니다)
    
    기획자 1 명 ( 쇼핑몰 경험이 있으면 좋고 준비중인분도 좋습니다 )
    
    총 2명이 필요한 상황입니다.
    
    디자인은 웹, 모바일웹의 아이콘 및 디자인을 구상하게 됩니다. (원한다면 html의 코드 구성까지 가능합니다.)
    
    기획자는 해당 기획이 틀어지지않게 조정해주는 아주 중요한 역할을 맡으며, 부가적으로 트렌드 및 쇼핑몰에서 원하는 기능을 팀원간에 공유해줘야 합니다. 또 개발후의 오류를 찾은후 개발자(작성자)에게 전달해줘야합니다
    
    
    
    시작은 2022년 7월 1일 부터 예정이며, 사람이 안모여도 진행 할 예정입니다.
    
    첫 프로젝트는 정해져있으며, 카페24에서 없던 기능입니다. (시장조사 완료)
    
    
    
    대화는 텔레그램 또는 카카오톡 둘중 하나 선택해서 할 예정이며, 디스코드도 가능합니다.
    
    프로젝트 진행중 건성건성한 사람은 바로 제외합니다. (현 직장에서도 느끼지만, 일 하기 싫으면 그냥 하지말아주세요..)
    
    배울려고 하시는분은 환영이며, 자기일 잘 소화해내면 환영입니다.
    
    사람은 완벽이 거의 불가능합니다 하지만 노력으로 완벽을 만들 수는 있습니다
    
    
    
    거의 보통 주말에만 회의 또는 의견수립의 시간 및 개발시간을 가질 예정입니다.
    
    시간은 추후 다시 정해도 상관없습니다.
    
    평일의 자기의 일에 지장안가는 선에서 진행예정입니다`,
  },
  {
    id: 4,
    type: "프로젝트",
    year: "1111.02.23",
    title: "샘플입니다아아ㅏ아",
    tag: ["#오프라인", "#1231명", "#1초"],
    skills: ["가나다라", "마바사ㅏ아", "nodㅇe"],
    write: "아르헨티나명",
    contact: "GoogleForm",
    view: "11",
    comment: "22",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `
    저희는 프론트엔드 3명 백엔드 1명으로 구성되어 미술품 및 그림 작가 중개 사이트를 개발 중입니다.



현재 백엔드와 디자이너 분을 모시고 있습니다.



백엔드 스택은 Spring Boot, MySQL, JPA를 디자이너는 Figma를 사용할 예정입니다.



프로젝트 내용은 신인 미술 작가들의 그림을 홍보하며 구매를 위한 컨택을 해줄 사이트를 개발하는 것입니다.



수입을 바라는 프로젝트는 아니며 학습과 취업을 위한 포트폴리오 용도로 생각하고 있습니다.



팀원들 모두 초보 개발자들입니다.

실력에 상관없이 같이 배우고자 하는 분을 원합니다 ^^ b



모집기간 : ~ 22.06.12



감사합니다 (-- ) (__ )`,
  },
  {
    id: 5,
    type: "프로젝트",
    year: "1911.11.14",
    title: "이것또한 샘플입니다 ~!",
    tag: ["#온라인", "#2231명", "#100초"],
    skills: ["bootstrap", "hahah", "node"],
    write: "제갈공명",
    view: "111111",
    contact: "email",
    comment: "22",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `안녕하세요 게임을 좋아하는 백엔드 개발자입니다.



    사이드프로젝트를 진행하기 위해 인프라 구성을 끝내놓은 상태입니다.(단순히 개발이 좋아서 준비하던건데 사이즈가 커버렸네요...)
    
    
    
    프로젝트를 함께 진행하실 취준생 혹은 현직자분 구합니다.
    
    
    
    모집분야
    
    1. 디자인(UI/UX)
    
    2. 프론트엔드 리더
    
    
    
    프로젝트는 A to Z로 진행하며 원하는 기술스택을 최대한 프로젝트에 녹여 진행이 목표입니다.
    
    다만 단순하게 잠깐 개발하고 끝내는게 아닌
    
    지속적으로 개발하고 배포하고 개선하면서 서로의 커리어에 긍정적인 영향을 줄 팀원분을 찾고 싶어요.
    
    
    
    기획은 다같이 진행 예정입니다.`,
  },
];
