export const studyData = [
  {
    id: 1,
    type: "스터디",
    year: "2022.06.10",
    title: "스터디하실분~~",
    tag: ["#온라인", "#1명", "#2개월"],
    skills: ["React", "javascript", "nestjs"],
    write: "세종대왕",
    view: "30",
    comment: "0",
    contact: "email",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `
      저희는 프론트엔드 3명 백엔드 1명으로 구성되어 미술품 및 그림 작가 중개 사이트를 개발 중입니다.
  
  
  
  현재 백엔드와 디자이너 분을 모시고 있습니다.
  
  
  
  백엔드 스택은 Spring Boot, MySQL, JPA를 디자이너는 Figma를 사용할 예정입니다.
  
  
  
  프로젝트 내용은 신인 미술 작가들의 그림을 홍보하며 구매를 위한 컨택을 해줄 사이트를 개발하는 것입니다.
  
  
  
  수입을 바라는 프로젝트는 아니며 학습과 취업을 위한 포트폴리오 용도로 생각하고 있습니다.
  
  
  
  팀원들 모두 초보 개발자들입니다.
  
  실력에 상관없이 같이 배우고자 하는 분을 원합니다 ^^ b
  
  
  
  모집기간 : ~ 22.06.12
  
  
  
  감사합니다 (-- ) (__ )`,
  },
  {
    id: 2,
    type: "스터디",
    year: "1999.02.11",
    title: "백앤드 스터디하실분~~",
    tag: ["#온라인", "#4명", "#12개월"],
    skills: ["ㅋㅋㅋ", "푸하하", "node"],
    write: "광개토대왕",
    contact: "email",
    view: "100123",
    comment: "1230",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `스터디 주제 : 팀 프로젝트

    스터디 목표 : 결과물 만들어내기!
    
    (첫 프로젝트는 네이버 웹툰 클론 코딩입니다.)
    
    저희 스터디는 js를 공부합니다.
    
    
    
    스터디 일정(횟수) : (평일) 월,수,금 8시~12시, (주말) 일요일 8시~12시
    
    
    
    처음 시작하시는 분들도 있고, 다 같이 공부하려고 모이는 스터디 그룹입니다.
    
    따라서 포트폴리오나 당장 결과물이 원한다 하시는 분은 같이하기 어렵습니다...
    
    
    
    공부 할 시간이 많은 분, 단기적으로 열심히 할 사람보단, 장기적으로 열심히 할 분들, 혼자 하는데 방향성을 못 잡으시거나, 열심히 하려고는 하는데 막막하신 분들을 환영입니다!
    
    
    
    팀 프로젝트 이외에 같이 진도를 맞춰서 인강(책)을 공부할 생각이라, 인강(책)값 정도만 자신에게 투자할 수 있는 분이셨으면 좋겠습니다. (최대한 부담 안가는 쪽으로 정할 겁니다.)
    
    
    
    스터디 규칙:
    
    오셔서 잠수 타시는 분들이나 열심히 안 하시는 분들 때문에 열심히 하는 분들이 피해를 보아 규칙을 정했습니다!
    
    
    
    스터디 그룹 규칙
    
    사유 없이 2회 이상 결석 시 추방
    
    3일 연속 사유 없이 공부 인증이 없을 시 경고
    
    (경고 3회 누적 시 추방)
    
    
    
    조건에 맞지 않아도 하고 싶은 분들은 와서 얼마든지 물어봐 주세요!`,
  },
  {
    id: 3,
    type: "스터디",
    year: "2222.12.23",
    title: "Front end 스터디 구해요~!!~",
    tag: ["#오프라인", "#1231명", "#1초"],
    skills: ["bootstrap", "hahah", "node"],
    write: "제갈공명",
    view: "111111",
    contact: "email",
    comment: "22",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `안녕하세요.



    프론트엔드 코딩 입문 및 왕초보 수준부터 공부하려고 합니다.
    
    
    
    한 주 동안 강의를 듣고 서로 강의내용에 대해 궁금하거나 질문 사항들을 주고받는
    
    
    
    디스코드 온라인 회의를 매주 일요일에 진행하려고 합니다.
    
    
    
    상세 커리큘럼과 시작일은 인원 모집되면 구성원들과 합의하여 정할 생각입니다.
    
    
    
    진행 계획은 2달정도 생각하고 있고 아래 강의를 토대로 공부하려고 합니다.
    
    
    
    https://www.udemy.com/course/the-web-developer-bootcamp-2021-korea/
    
    
    
    모집인원은 4명으로 생각 중입니다.
    
    
    
    관심있는분들은 댓글 남겨주세요.`,
  },
  {
    id: 4,
    type: "스터디",
    year: "1999.02.11",
    title: "백앤드 스터디하실분~~",
    tag: ["#온라인", "#4명", "#12개월"],
    skills: ["ㅋㅋㅋ", "푸하하", "node"],
    write: "광개토대왕",
    view: "100123",
    contact: "카카오톡",
    comment: "1230",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `
      1) 이런 분들을 구해요!
올해 안에 취업, 이직 준비중이고, 간절하신 분
코딩테스트 대비 알고리즘 스터디를 찾고 계시는 분
코테 사용 언어가 파이썬이신분
서로 으쌰으쌰 해줄 수 있으신 분
스터디에 적극적으로 참여해 주실 수 있는 분
백준 티어 골드5 이하이신분 (너무 고수시면 지루함으로 인한 탈주 방지)




2) 이렇게 공부합니다.
https://solved.ac/class 에 있는 레벨 3, 4 문제를 돌아가며 1일 1문제씩 풉니다. 어느정도 진행 후 5레벨도 풀 예정입니다. (오늘은 레벨3 1문제, 내일은 레벨4 1문제 이런식으로)
푼 문제의 코드는 단톡방에 공유합니다.
단톡방에 공유하면서, 어떻게 생각했고 풀었는지 간략하게 설명합니다.




3) 이런 분들이 오셨으면 좋겠습니다.
실력에 관계없이 열정적인 참여가 가능하신 분 (저도 백준 티어 실버 3입니다 부담가지지 말고 참여해주세요!)
순수 공부 목적이신 분 (여미새 / 남미새 사절합니다)
끈기를 가지고 롱런하실분 (제일 중요)


2명이서 진행중이고, 추가로 2명 더 모집해서 다양한 인사이트를 넓히고자 합니다.

서로 채용공고도 공유하면서 좋은 스터디로 발전하길 바랍니다.





오픈카톡 문의 링크 :

https://open.kakao.com/o/sEMQB3he`,
  },
  {
    id: 5,
    type: "스터디",
    year: "2222.12.23",
    title: "Front end 스터디 구해요~!!~",
    tag: ["#오프라인", "#1231명", "#1초"],
    skills: ["bootstrap", "hahah", "node"],
    write: "제갈공명",
    contact: "카카오톡",
    view: "111111",
    comment: "22",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `
      안녕하세요.

혼자 공부를 하면 점점 나약해지는 것 같아 여러 사람들과 함께 공부하고자 게더타운 페이지를 만들었습니다.

온라인 도서관처럼 운영할 페이지입니다. 함께 코드 공부하실 분들 모집합니다.



Propose



이 공간은 코드를 공부하시는 분들을 모을 생각입니다.(프론트엔드,백엔드,UX..) 그래서 코딩공간을 나뉘어 놓았습니다. 스스로의 공부를 지향하며, 커뮤니티 안 자율적인 스터디 형성이 되는것을 궁극적 목표로 삼았습니다. 그래서 개개인의 의사와 합의에 따른 프론트와 백엔드 간의 미니프로젝트가 진행되면 좋겠네요. 그래서 스터디 룸과 같은 공간을 갖춰 놓았습니다.



Rule





특정상황을 제외하고는 코딩공간에서는 캠을 켜주세요.
방명록을 통해서 본인의 출입시간과 공부했던 것들을 공유해주세요.
3.  자유로운 출입과 공부 시간을 가져도 좋습니다. 다만, 본인의 약속(주간 공부시간)을 3회 어기시면 퇴출입니다.

`,
  },
  {
    id: 6,
    type: "스터디",
    year: "1999.02.11",
    title: "과자먹고싶다~~",
    tag: ["#오프라인", "#4명", "#12개월"],
    skills: ["ㅋㅋㅋ", "푸하하", "node"],
    write: "보고싶으",
    contact: "카카오톡",
    view: "100123",
    comment: "1230",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `안녕하세요

      안드로이드 초보 스터디 모집합니다.
      
      천천히 앱 따라 만들기를 통해 실력을 키워나가고 싶은 분들 연락주세요~
      
      코틀린을 모르시는 분은 자바로 먼저 구현하시고 수정하셔도 됩니다.
      
      
      
      참고로 저는 현직자이고 저를 제외한 현재 구성원은 초보 한 분 계십니다.
      
      편하게 연락주세요~`,
  },
  {
    id: 7,
    type: "스터디",
    year: "2222.12.23",
    title: "계곡가고싶다 ㅠ!!~",
    tag: ["#계곡", "#1231명", "#1초"],
    skills: ["bootstrap", "hahah", "node"],
    write: "ㄱ꼐곡",
    view: "123",
    contact: "GoogleForm",
    comment: "22",
    url:
      Math.random().toString(36).slice(2) + Math.random().toString(36).slice(2),
    explan: `스터디 : 매주 토요일 10시 ~ 12시


      1주 잠실 이룸 스터디 - 1주 게더타운을 이용한 온라인 스터디
      
      
      격주로 온오프 섞어서 진행해요
      
      
      혼자서 공부가 잘 안되시는 분들 다같이 으쌰으쌰 하면서 스터디 진행하실 분들 연락 주세요!
      
      
       
      
      
      현재 알고리즘 1회 진행하고 2회 진행중이구요
      
      
      cs 스터디도 이번주부터 시작하고 있습니다
      
      
      바빠져서 진도를 잘 못따라가게 된다면 말씀 주시구 차주까지 완성 하는 등 유기적으로 진행하려고 합니다
      
      
       
      
      
      지금 6명의 인원이 진행하고 있고 최대 3분 모집할 예정입니다. 6월 11일부터 오프라인 스터디가 있습니다. 
      
      
      책 진행 상황에 따라 달라질 수 있지만 대략 2달 내외로 cs 스터디는 마무리 될 예정이에요 
      `,
  },
];
